
#include<stdio.h>
#include<stdlib.h>
//#include"file.h"
//#include"food.h"
int system(const char *string);
void printHead( )      /*打印菜品信息的表头*/
{
printf("%8s%10s%8s%6s%6s%8s%6s%6s\n","序号","菜名","菜系","色","香","味","总分","名次");
}

void menu( )         /*顶层菜单函数*/
{
		printf("******** 1. 显示基本信息 ********\n");
		printf("******** 2. 基本信息管理 ********\n");
		printf("******** 3. 菜品评分管理 ********\n");
		printf("******** 4. 评分项目统计 ********\n");
        printf("******** 5. 根据条件查询 ********\n");
		printf("******** 0. 退出         ********\n");
}

void menuBase( )     /*2、基本信息管理菜单函数*/
{
		printf("%%%%%%%% 1. 插入菜品记录 %%%%%%%%\n");
		printf("%%%%%%%% 2. 删除菜品记录 %%%%%%%%\n");
		printf("%%%%%%%% 3. 修改菜品记录 %%%%%%%%\n");
		printf("%%%%%%%% 0. 返回上层菜单 %%%%%%%%\n");
}

void menuScore( )     /*3、菜品评分菜单函数*/
{
		printf("@@@@@@@@ 1. 计算菜品总分 @@@@@@@@\n");
		printf("@@@@@@@@ 2. 根据总分排名 @@@@@@@@\n");
		printf("@@@@@@@@ 0. 返回上层菜单 @@@@@@@@\n");
}
 
void menuCount( )    /*4、评分项目菜单函数*/
{
		printf("&&&&&&&& 1. 求评分最高分 &&&&&&&&\n");
		printf("&&&&&&&& 2. 求评分最低分 &&&&&&&&\n");
		printf("&&&&&&&& 3. 求评分平均分 &&&&&&&&\n");
		printf("&&&&&&&& 0. 返回上层菜单 &&&&&&&&\n");
}

void menuSearch()    /*5、根据条件查询菜单函数*/
{
		printf("######## 1. 按序号查询   ########\n");
		printf("######## 2. 按菜名查询   ########\n");
		printf("######## 3. 按名次查询   ########\n");
		printf("######## 0. 返回上层菜单 ########\n");
}



int main( )
{
printf("欢迎来到美食评分管理系统\n");
menu( );	
      return 0;
}